export const departmentsCardData = [
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-blue-500"
        height="40"
        width="40"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M0 224v272c0 8.84 7.16 16 16 16h80V192H32c-17.67 0-32 14.33-32 32zm360-48h-24v-40c0-4.42-3.58-8-8-8h-16c-4.42 0-8 3.58-8 8v64c0 4.42 3.58 8 8 8h48c4.42 0 8-3.58 8-8v-16c0-4.42-3.58-8-8-8zm137.75-63.96l-160-106.67a32.02 32.02 0 0 0-35.5 0l-160 106.67A32.002 32.002 0 0 0 128 138.66V512h128V368c0-8.84 7.16-16 16-16h96c8.84 0 16 7.16 16 16v144h128V138.67c0-10.7-5.35-20.7-14.25-26.63zM320 256c-44.18 0-80-35.82-80-80s35.82-80 80-80 80 35.82 80 80-35.82 80-80 80zm288-64h-64v320h80c8.84 0 16-7.16 16-16V224c0-17.67-14.33-32-32-32z"></path>
      </svg>
    ),
    title: "আলিয়া",
    description: "ইসলামী শিক্ষা অর্জনের জন্য একটি সুনির্দিষ্ট কোর্স।",
  },

  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 576 512"
        className="text-green-500"
        height="40"
        width="40"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M542.22 32.05c-54.8 3.11-163.72 14.43-230.96 55.59-4.64 2.84-7.27 7.89-7.27 13.17v363.87c0 11.55 12.63 18.85 23.28 13.49 69.18-34.82 169.23-44.32 218.7-46.92 16.89-.89 30.02-14.43 30.02-30.66V62.75c.01-17.71-15.35-31.74-33.77-30.7zM264.73 87.64C197.5 46.48 88.58 35.17 33.78 32.05 15.36 31.01 0 45.04 0 62.75V400.6c0 16.24 13.13 29.78 30.02 30.66 49.49 2.6 149.59 12.11 218.77 46.95 10.62 5.35 23.21-1.94 23.21-13.46V100.63c0-5.29-2.62-10.14-7.27-12.99z"></path>
      </svg>
    ),
    title: "হিফজ",
    description: "কুরআন মুখস্থ করার জন্য বিশেষ প্রোগ্রাম।",
  },

  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 512 512"
        className="text-yellow-500"
        height="40"
        width="40"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M458.622 255.92l45.985-45.005c13.708-12.977 7.316-36.039-10.664-40.339l-62.65-15.99 17.661-62.015c4.991-17.838-11.829-34.663-29.661-29.671l-61.994 17.667-15.984-62.671C337.085.197 313.765-6.276 300.99 7.228L256 53.57 211.011 7.229c-12.63-13.351-36.047-7.234-40.325 10.668l-15.984 62.671-61.995-17.667C74.87 57.907 58.056 74.738 63.046 92.572l17.661 62.015-62.65 15.99C.069 174.878-6.31 197.944 7.392 210.915l45.985 45.005-45.985 45.004c-13.708 12.977-7.316 36.039 10.664 40.339l62.65 15.99-17.661 62.015c-4.991 17.838 11.829 34.663 29.661 29.671l61.994-17.667 15.984 62.671c4.439 18.575 27.696 24.018 40.325 10.668L256 458.61l44.989 46.001c12.5 13.488 35.987 7.486 40.325-10.668l15.984-62.671 61.994 17.667c17.836 4.994 34.651-11.837 29.661-29.671l-17.661-62.015 62.65-15.99c17.987-4.302 24.366-27.367 10.664-40.339l-45.984-45.004z"></path>
      </svg>
    ),
    title: "তাকসিসি",
    description: "উন্নত ইসলামী গবেষণার জন্য প্রস্তাবিত প্রোগ্রাম।",
  },

  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 384 512"
        className="text-gray-500"
        height="40"
        width="40"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M360 0H24C10.745 0 0 10.745 0 24v16c0 13.255 10.745 24 24 24 0 90.965 51.016 167.734 120.842 192C75.016 280.266 24 357.035 24 448c-13.255 0-24 10.745-24 24v16c0 13.255 10.745 24 24 24h336c13.255 0 24-10.745 24-24v-16c0-13.255-10.745-24-24-24 0-90.965-51.016-167.734-120.842-192C308.984 231.734 360 154.965 360 64c13.255 0 24-10.745 24-24V24c0-13.255-10.745-24-24-24zm-75.078 384H99.08c17.059-46.797 52.096-80 92.92-80 40.821 0 75.862 33.196 92.922 80zm.019-256H99.078C91.988 108.548 88 86.748 88 64h208c0 22.805-3.987 44.587-11.059 64z"></path>
      </svg>
    ),
    title: "কওমি (শীঘ্রই আসছে)",
    description: "কওমি মাদ্রাসার জন্য নতুন প্রস্তাবিত কোর্স।",
  },
];

export const contactUsData = [
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 512 512"
        className="text-green-600 text-4xl mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M497.39 361.8l-112-48a24 24 0 0 0-28 6.9l-49.6 60.6A370.66 370.66 0 0 1 130.6 204.11l60.6-49.6a23.94 23.94 0 0 0 6.9-28l-48-112A24.16 24.16 0 0 0 122.6.61l-104 24A24 24 0 0 0 0 48c0 256.5 207.9 464 464 464a24 24 0 0 0 23.4-18.6l24-104a24.29 24.29 0 0 0-14.01-27.6z"></path>
      </svg>
    ),
    title: "ফোন করুন",
    description: "+880 1712-648916",
  },

  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 512 512"
        className="text-green-600 text-4xl mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M502.3 190.8c3.9-3.1 9.7-.2 9.7 4.7V400c0 26.5-21.5 48-48 48H48c-26.5 0-48-21.5-48-48V195.6c0-5 5.7-7.8 9.7-4.7 22.4 17.4 52.1 39.5 154.1 113.6 21.1 15.4 56.7 47.8 92.2 47.6 35.7.3 72-32.8 92.3-47.6 102-74.1 131.6-96.3 154-113.7zM256 320c23.2.4 56.6-29.2 73.4-41.4 132.7-96.3 142.8-104.7 173.4-128.7 5.8-4.5 9.2-11.5 9.2-18.9v-19c0-26.5-21.5-48-48-48H48C21.5 64 0 85.5 0 112v19c0 7.4 3.4 14.3 9.2 18.9 30.6 23.9 40.7 32.4 173.4 128.7 16.8 12.2 50.2 41.8 73.4 41.4z"></path>
      </svg>
    ),
    title: "ইমেইল",
    description: "at-tahfiz@gmail.com",
  },

  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 384 512"
        className="text-green-600 text-4xl mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M172.268 501.67C26.97 291.031 0 269.413 0 192 0 85.961 85.961 0 192 0s192 85.961 192 192c0 77.413-26.97 99.031-172.268 309.67-9.535 13.774-29.93 13.773-39.464 0zM192 272c44.183 0 80-35.817 80-80s-35.817-80-80-80-80 35.817-80 80 35.817 80 80 80z"></path>
      </svg>
    ),
    title: "ঠিকানা",
    description: "কাশিয়ানি বাজার, কাশিয়ানি",
  },
];

export const campusData = [
  {
    title: "মেইন ক্যাম্পাস",
    address: "ইনসাফ গার্ডেন সিটি, দৌলতপুর, কোটবাড়ি রোড, আদর্শ সদর, কুমিল্লা",
    phone: "+880 1716453952",
  },
  {
    title: "সিটি ক্যাম্পাস",
    address: "ঢাকা রোড, কুমিল্লা শহর",
    phone: "+880 1712345678",
  },
  {
    title: "মাদ্রাসা শাখা",
    address: "কুসুমপুর, ব্রাহ্মণবাড়িয়া",
    phone: "+880 1723456789",
  },
];

export const servicesData = [
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 448 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M448 360V24c0-13.3-10.7-24-24-24H96C43 0 0 43 0 96v320c0 53 43 96 96 96h328c13.3 0 24-10.7 24-24v-16c0-7.5-3.5-14.3-8.9-18.7-4.2-15.4-4.2-59.3 0-74.7 5.4-4.3 8.9-11.1 8.9-18.6zM128 134c0-3.3 2.7-6 6-6h212c3.3 0 6 2.7 6 6v20c0 3.3-2.7 6-6 6H134c-3.3 0-6-2.7-6-6v-20zm0 64c0-3.3 2.7-6 6-6h212c3.3 0 6 2.7 6 6v20c0 3.3-2.7 6-6 6H134c-3.3 0-6-2.7-6-6v-20zm253.4 250H96c-17.7 0-32-14.3-32-32 0-17.6 14.4-32 32-32h285.4c-1.9 17.1-1.9 46.9 0 64z"></path>
      </svg>
    ),
    title: "ইসলামিক স্টাডিজ",
    subTitle: "কুরআন ও হাদিসের গভীর পাঠ",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M208 352c-2.39 0-4.78.35-7.06 1.09C187.98 357.3 174.35 360 160 360c-14.35 0-27.98-2.7-40.95-6.91-2.28-.74-4.66-1.09-7.05-1.09C49.94 352-.33 402.48 0 464.62.14 490.88 21.73 512 48 512h224c26.27 0 47.86-21.12 48-47.38.33-62.14-49.94-112.62-112-112.62zm-48-32c53.02 0 96-42.98 96-96s-42.98-96-96-96-96 42.98-96 96 42.98 96 96 96zM592 0H208c-26.47 0-48 22.25-48 49.59V96c23.42 0 45.1 6.78 64 17.8V64h352v288h-64v-64H384v64h-76.24c19.1 16.69 33.12 38.73 39.69 64H592c26.47 0 48-22.25 48-49.59V49.59C640 22.25 618.47 0 592 0z"></path>
      </svg>
    ),
    title: "যোগ্য শিক্ষকবৃন্দ",
    subTitle: "ইসলামি শিক্ষায় বিশেষজ্ঞ আলেমগণ",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 448 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M448 358.4V25.6c0-16-9.6-25.6-25.6-25.6H96C41.6 0 0 41.6 0 96v320c0 54.4 41.6 96 96 96h326.4c12.8 0 25.6-9.6 25.6-25.6v-16c0-6.4-3.2-12.8-9.6-19.2-3.2-16-3.2-60.8 0-73.6 6.4-3.2 9.6-9.6 9.6-19.2zM301.08 145.82c.6-1.21 1.76-1.82 2.92-1.82s2.32.61 2.92 1.82l11.18 22.65 25 3.63c2.67.39 3.74 3.67 1.81 5.56l-18.09 17.63 4.27 24.89c.36 2.11-1.31 3.82-3.21 3.82-.5 0-1.02-.12-1.52-.38L304 211.87l-22.36 11.75c-.5.26-1.02.38-1.52.38-1.9 0-3.57-1.71-3.21-3.82l4.27-24.89-18.09-17.63c-1.94-1.89-.87-5.17 1.81-5.56l24.99-3.63 11.19-22.65zm-57.89-69.01c13.67 0 27.26 2.49 40.38 7.41a6.775 6.775 0 1 1-2.38 13.12c-.67 0-3.09-.21-4.13-.21-52.31 0-94.86 42.55-94.86 94.86 0 52.3 42.55 94.86 94.86 94.86 1.03 0 3.48-.21 4.13-.21 3.93 0 6.8 3.14 6.8 6.78 0 2.98-1.94 5.51-4.62 6.42-13.07 4.87-26.59 7.34-40.19 7.34C179.67 307.19 128 255.51 128 192c0-63.52 51.67-115.19 115.19-115.19zM380.8 448H96c-19.2 0-32-12.8-32-32s16-32 32-32h284.8v64z"></path>
      </svg>
    ),
    title: "কুরআন মুখস্থকরণ",
    subTitle: "শিক্ষার্থীদের জন্য হিফজ প্রোগ্রাম",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 448 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M319.4 320.6L224 416l-95.4-95.4C57.1 323.7 0 382.2 0 454.4v9.6c0 26.5 21.5 48 48 48h352c26.5 0 48-21.5 48-48v-9.6c0-72.2-57.1-130.7-128.6-133.8zM13.6 79.8l6.4 1.5v58.4c-7 4.2-12 11.5-12 20.3 0 8.4 4.6 15.4 11.1 19.7L3.5 242c-1.7 6.9 2.1 14 7.6 14h41.8c5.5 0 9.3-7.1 7.6-14l-15.6-62.3C51.4 175.4 56 168.4 56 160c0-8.8-5-16.1-12-20.3V87.1l66 15.9c-8.6 17.2-14 36.4-14 57 0 70.7 57.3 128 128 128s128-57.3 128-128c0-20.6-5.3-39.8-14-57l96.3-23.2c18.2-4.4 18.2-27.1 0-31.5l-190.4-46c-13-3.1-26.7-3.1-39.7 0L13.6 48.2c-18.1 4.4-18.1 27.2 0 31.6z"></path>
      </svg>
    ),
    title: "গ্রাজুয়েশন প্রোগ্রাম",
    subTitle: "শিক্ষার্থীদের জন্য সনদ প্রদান",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 512 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M160 320h12v16c0 8.84 7.16 16 16 16h40c8.84 0 16-7.16 16-16v-16h12c17.67 0 32-14.33 32-32V64c0-17.67-14.33-32-32-32V16c0-8.84-7.16-16-16-16h-64c-8.84 0-16 7.16-16 16v16c-17.67 0-32 14.33-32 32v224c0 17.67 14.33 32 32 32zm304 128h-1.29C493.24 413.99 512 369.2 512 320c0-105.88-86.12-192-192-192v64c70.58 0 128 57.42 128 128s-57.42 128-128 128H48c-26.51 0-48 21.49-48 48 0 8.84 7.16 16 16 16h480c8.84 0 16-7.16 16-16 0-26.51-21.49-48-48-48zm-360-32h208c4.42 0 8-3.58 8-8v-16c0-4.42-3.58-8-8-8H104c-4.42 0-8 3.58-8 8v16c0 4.42 3.58 8 8 8z"></path>
      </svg>
    ),
    title: "বিজ্ঞান শিক্ষা",
    subTitle: "আধুনিক বিজ্ঞান বিষয়ের সমন্বয়",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M624 416H381.54c-.74 19.81-14.71 32-32.74 32H288c-18.69 0-33.02-17.47-32.77-32H16c-8.8 0-16 7.2-16 16v16c0 35.2 28.8 64 64 64h512c35.2 0 64-28.8 64-64v-16c0-8.8-7.2-16-16-16zM576 48c0-26.4-21.6-48-48-48H112C85.6 0 64 21.6 64 48v336h512V48zm-64 272H128V64h384v256z"></path>
      </svg>
    ),
    title: "ডিজিটাল লার্নিং",
    subTitle: "অনলাইন ক্লাস ও রিসোর্স",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M152.1 236.2c-3.5-12.1-7.8-33.2-7.8-33.2h-.5s-4.3 21.1-7.8 33.2l-11.1 37.5H163zM616 96H336v320h280c13.3 0 24-10.7 24-24V120c0-13.3-10.7-24-24-24zm-24 120c0 6.6-5.4 12-12 12h-11.4c-6.9 23.6-21.7 47.4-42.7 69.9 8.4 6.4 17.1 12.5 26.1 18 5.5 3.4 7.3 10.5 4.1 16.2l-7.9 13.9c-3.4 5.9-10.9 7.8-16.7 4.3-12.6-7.8-24.5-16.1-35.4-24.9-10.9 8.7-22.7 17.1-35.4 24.9-5.8 3.5-13.3 1.6-16.7-4.3l-7.9-13.9c-3.2-5.6-1.4-12.8 4.2-16.2 9.3-5.7 18-11.7 26.1-18-7.9-8.4-14.9-17-21-25.7-4-5.7-2.2-13.6 3.7-17.1l6.5-3.9 7.3-4.3c5.4-3.2 12.4-1.7 16 3.4 5 7 10.8 14 17.4 20.9 13.5-14.2 23.8-28.9 30-43.2H412c-6.6 0-12-5.4-12-12v-16c0-6.6 5.4-12 12-12h64v-16c0-6.6 5.4-12 12-12h16c6.6 0 12 5.4 12 12v16h64c6.6 0 12 5.4 12 12zM0 120v272c0 13.3 10.7 24 24 24h280V96H24c-13.3 0-24 10.7-24 24zm58.9 216.1L116.4 167c1.7-4.9 6.2-8.1 11.4-8.1h32.5c5.1 0 9.7 3.3 11.4 8.1l57.5 169.1c2.6 7.8-3.1 15.9-11.4 15.9h-22.9a12 12 0 0 1-11.5-8.6l-9.4-31.9h-60.2l-9.1 31.8c-1.5 5.1-6.2 8.7-11.5 8.7H70.3c-8.2 0-14-8.1-11.4-15.9z"></path>
      </svg>
    ),
    title: "ভাষা শিক্ষা প্রোগ্রাম",
    subTitle: "আরবি, ইংরেজি এবং অন্যান্য ভাষা",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-2xl sm:text-5xl text-green-500 mb-4"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M488 192H336v56c0 39.7-32.3 72-72 72s-72-32.3-72-72V126.4l-64.9 39C107.8 176.9 96 197.8 96 220.2v47.3l-80 46.2C.7 322.5-4.6 342.1 4.3 357.4l80 138.6c8.8 15.3 28.4 20.5 43.7 11.7L231.4 448H368c35.3 0 64-28.7 64-64h16c17.7 0 32-14.3 32-32v-64h8c13.3 0 24-10.7 24-24v-48c0-13.3-10.7-24-24-24zm147.7-37.4L555.7 16C546.9.7 527.3-4.5 512 4.3L408.6 64H306.4c-12 0-23.7 3.4-33.9 9.7L239 94.6c-9.4 5.8-15 16.1-15 27.1V248c0 22.1 17.9 40 40 40s40-17.9 40-40v-88h184c30.9 0 56 25.1 56 56v28.5l80-46.2c15.3-8.9 20.5-28.4 11.7-43.7z"></path>
      </svg>
    ),
    title: "কমিউনিটি সার্ভিস",
    subTitle: "স্থানীয় ও বৈশ্বিক মুসলিম সমাজের সেবা",
  },
];

export const studentLifeData = [
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 384 512"
        className="text-green-500"
        height="24"
        width="24"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M256 128c35.35 0 64-28.65 64-64S291.35 0 256 0s-64 28.65-64 64 28.65 64 64 64zm-30.63 169.75c14.06 16.72 39 19.09 55.97 5.22l88-72.02c17.09-13.98 19.59-39.19 5.62-56.28-13.97-17.11-39.19-19.59-56.31-5.62l-57.44 47-38.91-46.31c-15.44-18.39-39.22-27.92-64-25.33-24.19 2.48-45.25 16.27-56.37 36.92l-49.37 92.03c-23.4 43.64-8.69 96.37 34.19 123.75L131.56 432H40c-22.09 0-40 17.91-40 40s17.91 40 40 40h208c34.08 0 53.77-42.79 28.28-68.28L166.42 333.86l34.8-64.87 24.15 28.76z"></path>
      </svg>
    ),
    title: "আধ্যাত্মিক উন্নয়ন",
    description:
      "শিক্ষার্থীরা দৈনিক নামাজ, কুরআন তিলাওয়াত এবং ইসলামিক পাঠে অংশগ্রহণ করে তাদের আধ্যাত্মিক বিকাশ ও ধর্মীয় সংযোগ বাড়ায়।",
    image: "/student-life-1.webp",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 512 512"
        className="text-blue-500"
        height="24"
        width="24"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M352 96c0-53.02-42.98-96-96-96s-96 42.98-96 96 42.98 96 96 96 96-42.98 96-96zM233.59 241.1c-59.33-36.32-155.43-46.3-203.79-49.05C13.55 191.13 0 203.51 0 219.14v222.8c0 14.33 11.59 26.28 26.49 27.05 43.66 2.29 131.99 10.68 193.04 41.43 9.37 4.72 20.48-1.71 20.48-11.87V252.56c-.01-4.67-2.32-8.95-6.42-11.46zm248.61-49.05c-48.35 2.74-144.46 12.73-203.78 49.05-4.1 2.51-6.41 6.96-6.41 11.63v245.79c0 10.19 11.14 16.63 20.54 11.9 61.04-30.72 149.32-39.11 192.97-41.4 14.9-.78 26.49-12.73 26.49-27.06V219.14c-.01-15.63-13.56-28.01-29.81-27.09z"></path>
      </svg>
    ),
    title: "একাডেমিক উৎকর্ষতা",
    description:
      "আমাদের কঠোর একাডেমিক কারিকুলাম শিক্ষার্থীদের ইসলামী জ্ঞানের পাশাপাশি গণিত, বিজ্ঞান এবং সাহিত্য সহ আধুনিক বিষয়গুলিতে দক্ষ করে তোলে।",
    image: "/student-life-2.webp",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 496 512"
        className="text-orange-500"
        height="24"
        width="24"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M212.3 10.3c-43.8 6.3-86.2 24.1-122.2 53.8l77.4 77.4c27.8-35.8 43.3-81.2 44.8-131.2zM248 222L405.9 64.1c-42.4-35-93.6-53.5-145.5-56.1-1.2 63.9-21.5 122.3-58.7 167.7L248 222zM56.1 98.1c-29.7 36-47.5 78.4-53.8 122.2 50-1.5 95.5-17 131.2-44.8L56.1 98.1zm272.2 204.2c45.3-37.1 103.7-57.4 167.7-58.7-2.6-51.9-21.1-103.1-56.1-145.5L282 256l46.3 46.3zM248 290L90.1 447.9c42.4 34.9 93.6 53.5 145.5 56.1 1.3-64 21.6-122.4 58.7-167.7L248 290zm191.9 123.9c29.7-36 47.5-78.4 53.8-122.2-50.1 1.6-95.5 17.1-131.2 44.8l77.4 77.4zM167.7 209.7C122.3 246.9 63.9 267.3 0 268.4c2.6 51.9 21.1 103.1 56.1 145.5L214 256l-46.3-46.3zm116 292c43.8-6.3 86.2-24.1 122.2-53.8l-77.4-77.4c-27.7 35.7-43.2 81.2-44.8 131.2z"></path>
      </svg>
    ),
    title: "অতিরিক্ত কার্যক্রম",
    description:
      "শিক্ষার্থীরা খেলাধুলা, শিল্পকলা এবং বিতর্ক সহ বিভিন্ন কার্যক্রমে অংশগ্রহণ করে যা তাদের গুরুত্বপূর্ণ জীবন দক্ষতা এবং দলবদ্ধতা বিকাশে সহায়তা করে।",
    image: "/student-life-3.webp",
  },
];

export const dailyLifeData = [
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 448 512"
        className="text-purple-500"
        height="24"
        width="24"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M0 464c0 26.5 21.5 48 48 48h352c26.5 0 48-21.5 48-48V192H0v272zm320-196c0-6.6 5.4-12 12-12h40c6.6 0 12 5.4 12 12v40c0 6.6-5.4 12-12 12h-40c-6.6 0-12-5.4-12-12v-40zm0 128c0-6.6 5.4-12 12-12h40c6.6 0 12 5.4 12 12v40c0 6.6-5.4 12-12 12h-40c-6.6 0-12-5.4-12-12v-40zM192 268c0-6.6 5.4-12 12-12h40c6.6 0 12 5.4 12 12v40c0 6.6-5.4 12-12 12h-40c-6.6 0-12-5.4-12-12v-40zm0 128c0-6.6 5.4-12 12-12h40c6.6 0 12 5.4 12 12v40c0 6.6-5.4 12-12 12h-40c-6.6 0-12-5.4-12-12v-40zM64 268c0-6.6 5.4-12 12-12h40c6.6 0 12 5.4 12 12v40c0 6.6-5.4 12-12 12H76c-6.6 0-12-5.4-12-12v-40zm0 128c0-6.6 5.4-12 12-12h40c6.6 0 12 5.4 12 12v40c0 6.6-5.4 12-12 12H76c-6.6 0-12-5.4-12-12v-40zM400 64h-48V16c0-8.8-7.2-16-16-16h-32c-8.8 0-16 7.2-16 16v48H160V16c0-8.8-7.2-16-16-16h-32c-8.8 0-16 7.2-16 16v48H48C21.5 64 0 85.5 0 112v48h448v-48c0-26.5-21.5-48-48-48z"></path>
      </svg>
    ),
    title: "দৈনন্দিন জীবন",
    description:
      "শিক্ষার্থীরা একটি সু-সংগঠিত দৈনিক রুটিন অনুসরণ করে যেখানে নামাজ, পড়াশোনা, অতিরিক্ত কার্যক্রম এবং ব্যক্তিগত উন্নয়নের জন্য সময় বরাদ্দ থাকে। এটি শৃঙ্খলা ও আধ্যাত্মিক সমৃদ্ধি বাড়ায়।",
    image: "/daily-life.webp",
  },
];

export const islamicVideoData = [
  {
    link: "https://www.youtube.com/embed/wOICupV9IcM?si=zqXKDxFOmr53at28",
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 576 512"
        className="text-red-600"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"></path>
      </svg>
    ),
    title: "Tamirul ummah madrasha song",
    boldTitle: "পরিবেশনায়: ",
    description:
      "MD NAIMUL ISLAM NIHAN,SAYMA ISLAM TONNI,SUMAIYA ISLAM TANHA,SAIDA SULTANA NAFISA.",
  },
  {
    link: "https://www.youtube.com/embed/sQbK9I_X0xY?si=wGgQ1qDc2UtolHUy",
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 576 512"
        className="text-red-600"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"></path>
      </svg>
    ),
    title: "বিজ্ঞান মেলা",
    boldTitle: "পরিবেশনায়:",
    description: "TamirulUmmahMadrsha Science Fair",
  },
  {
    link: "https://www.youtube.com/embed/-DtawBC6SgA?si=lY2CSlJXrEj__XQ3",
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 576 512"
        className="text-red-600"
        height="1em"
        width="1em"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M549.655 124.083c-6.281-23.65-24.787-42.276-48.284-48.597C458.781 64 288 64 288 64S117.22 64 74.629 75.486c-23.497 6.322-42.003 24.947-48.284 48.597-11.412 42.867-11.412 132.305-11.412 132.305s0 89.438 11.412 132.305c6.281 23.65 24.787 41.5 48.284 47.821C117.22 448 288 448 288 448s170.78 0 213.371-11.486c23.497-6.321 42.003-24.171 48.284-47.821 11.412-42.867 11.412-132.305 11.412-132.305s0-89.438-11.412-132.305zm-317.51 213.508V175.185l142.739 81.205-142.739 81.201z"></path>
      </svg>
    ),
    title: "Our Student Naimul Islam Nihan",
    boldTitle: "পরিবেশনায়:",
    description:
      "সবার সেরা শিল্পী তুমি রাব্বুল আলামীন | Sobar Sera Shilpi | Naimul Islam Nihan | Hamd.",
  },
];

export const curriculumData = [
  {
    title: "ইবতেদায়ী (প্রাথমিক)",
    description:
      "ইবতেদায়ী স্তরটি প্রাথমিক শিক্ষা নিশ্চিত করে এবং আরবি, বাংলা, গণিতসহ অন্যান্য প্রাথমিক বিষয় শেখানো হয়।",
    time: "সময়কাল: ৫ বছর",
  },
  {
    title: "দাখিল",
    description:
      "দাখিল স্তরে ধর্মীয় শিক্ষা এবং সাধারণ শিক্ষার সমন্বয়ে মাধ্যমিক স্তরের পাঠ্যক্রম পড়ানো হয়।",
    time: "সময়কাল: ৫ বছর",
  },
  {
    title: "আলিম",
    description:
      "আলিম স্তরে উচ্চমাধ্যমিক স্তরের শিক্ষা দেওয়া হয়। ধর্মীয় জ্ঞানের পাশাপাশি বিজ্ঞানের বিষয়গুলো শেখানো হয়।",
    time: "সময়কাল: ২ বছর",
  },
  {
    title: "ফাজিল",
    description:
      "ফাজিল হল স্নাতক স্তর। এখানে শিক্ষার্থীরা ধর্মীয় এবং আধুনিক শিক্ষায় পারদর্শিতা অর্জন করেন।",
    time: "সময়কাল: ৩ বছর",
  },
  {
    title: "কামিল",
    description:
      "কামিল হল স্নাতকোত্তর স্তর। এটি মাদ্রাসা শিক্ষার সর্বোচ্চ স্তর হিসেবে বিবেচিত হয়।",
    time: "সময়কাল: ২ বছর",
  },
];

export const hifzCurriculumData = [
  {
    title: "প্রাথমিক স্তর",
    description:
      "এই স্তরে শিক্ষার্থীদের কুরআন শুদ্ধভাবে তিলাওয়াত শেখানো হয় এবং আরবি হরফ চেনানো হয়।",
    time: "সময়কাল: ১ বছর",
  },
  {
    title: "মধ্যম স্তর",
    description:
      "শিক্ষার্থীরা ছোট ছোট সূরা মুখস্থ করে এবং কুরআনের একাধিক পারা হিফজ শুরু করে।",
    time: "সময়কাল: ২ বছর",
  },
  {
    title: "উচ্চ স্তর",
    description:
      "শিক্ষার্থীরা সম্পূর্ণ কুরআন হিফজ সম্পন্ন করে এবং তাজবিদ ও তিলাওয়াতের উন্নতি সাধন করে।",
    time: "সময়কাল: ৩-৪ বছর",
  },
  {
    title: "মুরাজাআ (পুনরাবৃত্তি)",
    description:
      "এই পর্যায়ে সম্পূর্ণ মুখস্থ কুরআন পুনরাবৃত্তি করা হয় এবং স্মৃতিশক্তি মজবুত করা হয়।",
    time: "সময়কাল: আজীবন অধ্যবসায়",
  },
];

export const qaumiMadrasaCurriculumData = [
  {
    title: "নূরানী (প্রাথমিক স্তর)",
    description: "কুরআন তেলাওয়াত শেখার ভিত্তি এবং আরবি হরফ ও শব্দ চেনানো হয়।",
    time: "সময়কাল: ২ বছর",
  },
  {
    title: "হিফজুল কুরআন (কুরআন মুখস্থ)",
    description:
      "সম্পূর্ণ কুরআন মুখস্থ করা হয় এবং তাজবিদের সাথে সঠিক তেলাওয়াত শেখানো হয়।",
    time: "সময়কাল: ৩-৫ বছর",
  },
  {
    title: "ইবতেদায়ি (প্রাথমিক শিক্ষা)",
    description:
      "ফিকহ, আকাইদ, নাহু-সরফ, আরবি ব্যাকরণ ও বুনিয়াদি ইসলামী জ্ঞান শেখানো হয়।",
    time: "সময়কাল: ৫ বছর",
  },
  {
    title: "মুতাওয়াসসিতাহ (মাধ্যমিক শিক্ষা)",
    description:
      "আরবি ভাষা, হাদিস, তাফসির, ইসলামী সাহিত্য এবং ফিকহের গভীরতর জ্ঞান প্রদান।",
    time: "সময়কাল: আজীবন অধ্যবসায়",
  },
  {
    title: "মুরাজাআ (পুনরাবৃত্তি)",
    description:
      "এই পর্যায়ে সম্পূর্ণ মুখস্থ কুরআন পুনরাবৃত্তি করা হয় এবং স্মৃতিশক্তি মজবুত করা হয়।",
    time: "সময়কাল: ২ বছর",
  },
  {
    title: "সানাবিয়া উলিয়া (উচ্চ মাধ্যমিক)",
    description:
      "হাদিস, ফিকহ, ইসলামী যুক্তিবিদ্যা এবং সাহিত্য বিষয়ে বিশেষায়িত জ্ঞান অর্জন।",
    time: "সময়কাল: ২ বছর",
  },
  {
    title: "ফাযিল (স্নাতক)",
    description:
      "দাওরা হাদিস পর্যায়ে সিহাহ সিত্তাহ (ছয়টি প্রধান হাদিসের গ্রন্থ) পাঠ এবং গবেষণা।",
    time: "সময়কাল: ২ বছর",
  },
  {
    title: "কামিল (স্নাতকোত্তর)",
    description:
      "ইসলামী ফিকহে তাখাসসুস, তাফসির, হাদিস এবং গবেষণার মাধ্যমে বিশেষজ্ঞ হওয়া।",
    time: "সময়কাল: ২ বছর",
  },
];

export const ourHeritageData = [
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-blue-500 mx-auto mb-4"
        height="40"
        width="40"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M622.34 153.2L343.4 67.5c-15.2-4.67-31.6-4.67-46.79 0L17.66 153.2c-23.54 7.23-23.54 38.36 0 45.59l48.63 14.94c-10.67 13.19-17.23 29.28-17.88 46.9C38.78 266.15 32 276.11 32 288c0 10.78 5.68 19.85 13.86 25.65L20.33 428.53C18.11 438.52 25.71 448 35.94 448h56.11c10.24 0 17.84-9.48 15.62-19.47L82.14 313.65C90.32 307.85 96 298.78 96 288c0-11.57-6.47-21.25-15.66-26.87.76-15.02 8.44-28.3 20.69-36.72L296.6 284.5c9.06 2.78 26.44 6.25 46.79 0l278.95-85.7c23.55-7.24 23.55-38.36 0-45.6zM352.79 315.09c-28.53 8.76-52.84 3.92-65.59 0l-145.02-44.55L128 384c0 35.35 85.96 64 192 64s192-28.65 192-64l-14.18-113.47-145.03 44.56z"></path>
      </svg>
    ),
    title: "শিক্ষাক্ষেত্রে উৎকর্ষতা",
    description:
      "আত-তাহফিজ ইন্টারন্যাশনাল মাদরাসা শুরু থেকেই সেরা মানের ইসলামিক শিক্ষাদানের জন্য প্রতিশ্রুতিবদ্ধ। আমাদের গ্র্যাজুয়েটরা ধর্মীয় এবং আধুনিক জ্ঞানের ক্ষেত্রে দক্ষতা অর্জন করে, যা তাদের এ জীবন এবং পরকালে সফল করে তোলে।",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 448 512"
        className="text-green-500 mx-auto mb-4"
        height="40"
        width="40"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M448 360V24c0-13.3-10.7-24-24-24H96C43 0 0 43 0 96v320c0 53 43 96 96 96h328c13.3 0 24-10.7 24-24v-16c0-7.5-3.5-14.3-8.9-18.7-4.2-15.4-4.2-59.3 0-74.7 5.4-4.3 8.9-11.1 8.9-18.6zM128 134c0-3.3 2.7-6 6-6h212c3.3 0 6 2.7 6 6v20c0 3.3-2.7 6-6 6H134c-3.3 0-6-2.7-6-6v-20zm0 64c0-3.3 2.7-6 6-6h212c3.3 0 6 2.7 6 6v20c0 3.3-2.7 6-6 6H134c-3.3 0-6-2.7-6-6v-20zm253.4 250H96c-17.7 0-32-14.3-32-32 0-17.6 14.4-32 32-32h285.4c-1.9 17.1-1.9 46.9 0 64z"></path>
      </svg>
    ),
    title: "সমন্বিত পাঠ্যক্রম",
    description:
      "আমাদের পাঠ্যক্রম এমনভাবে ডিজাইন করা হয়েছে, যাতে ইসলামিক স্টাডিজ এবং আধুনিক শিক্ষার মধ্যে ভারসাম্য বজায় থাকে। আমরা ছাত্রদের আধ্যাত্মিক এবং বুদ্ধিবৃত্তিক উন্নতির উপর গুরুত্ব দিই।",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-yellow-500 mx-auto mb-4"
        height="40"
        width="40"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M0 480c0 17.67 14.33 32 32 32h64c17.67 0 32-14.33 32-32V160H0v320zm579.16-192c17.86-17.39 28.84-37.34 28.84-58.91 0-52.86-41.79-93.79-87.92-122.9-41.94-26.47-80.63-57.77-111.96-96.22L400 0l-8.12 9.97c-31.33 38.45-70.01 69.76-111.96 96.22C233.79 135.3 192 176.23 192 229.09c0 21.57 10.98 41.52 28.84 58.91h358.32zM608 320H192c-17.67 0-32 14.33-32 32v128c0 17.67 14.33 32 32 32h32v-64c0-17.67 14.33-32 32-32s32 14.33 32 32v64h64v-72c0-48 48-72 48-72s48 24 48 72v72h64v-64c0-17.67 14.33-32 32-32s32 14.33 32 32v64h32c17.67 0 32-14.33 32-32V352c0-17.67-14.33-32-32-32zM64 0S0 32 0 96v32h128V96c0-64-64-96-64-96z"></path>
      </svg>
    ),
    title: "বিশ্বাস ও সম্প্রদায়কে লালন",
    description:
      "আমাদের মাদ্রাসা শুধু শিক্ষা কেন্দ্র নয়; এটি এমন একটি সম্প্রদায় যেখানে ছাত্ররা শক্তিশালী ইসলামিক মূল্যবোধ, চরিত্র এবং তাদের বিশ্বাসের প্রতি গভীর সংযোগ গড়ে তোলে।",
  },
];

export const knowledgeData = [
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-blue-500"
        height="30"
        width="30"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M622.34 153.2L343.4 67.5c-15.2-4.67-31.6-4.67-46.79 0L17.66 153.2c-23.54 7.23-23.54 38.36 0 45.59l48.63 14.94c-10.67 13.19-17.23 29.28-17.88 46.9C38.78 266.15 32 276.11 32 288c0 10.78 5.68 19.85 13.86 25.65L20.33 428.53C18.11 438.52 25.71 448 35.94 448h56.11c10.24 0 17.84-9.48 15.62-19.47L82.14 313.65C90.32 307.85 96 298.78 96 288c0-11.57-6.47-21.25-15.66-26.87.76-15.02 8.44-28.3 20.69-36.72L296.6 284.5c9.06 2.78 26.44 6.25 46.79 0l278.95-85.7c23.55-7.24 23.55-38.36 0-45.6zM352.79 315.09c-28.53 8.76-52.84 3.92-65.59 0l-145.02-44.55L128 384c0 35.35 85.96 64 192 64s192-28.65 192-64l-14.18-113.47-145.03 44.56z"></path>
      </svg>
    ),
    title: "শিক্ষাগত উৎকর্ষতা",
    description:
      "আমাদের মাদ্রাসা ইসলামিক ও আধুনিক উভয় শিক্ষায় দক্ষ ছাত্র তৈরি করতে প্রতিশ্রুতিবদ্ধ, যা তাদের আগামী দিনের চ্যালেঞ্জ মোকাবিলা করতে প্রস্তুত করে।",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 640 512"
        className="text-green-500"
        height="30"
        width="30"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M208 352c-2.39 0-4.78.35-7.06 1.09C187.98 357.3 174.35 360 160 360c-14.35 0-27.98-2.7-40.95-6.91-2.28-.74-4.66-1.09-7.05-1.09C49.94 352-.33 402.48 0 464.62.14 490.88 21.73 512 48 512h224c26.27 0 47.86-21.12 48-47.38.33-62.14-49.94-112.62-112-112.62zm-48-32c53.02 0 96-42.98 96-96s-42.98-96-96-96-96 42.98-96 96 42.98 96 96 96zM592 0H208c-26.47 0-48 22.25-48 49.59V96c23.42 0 45.1 6.78 64 17.8V64h352v288h-64v-64H384v64h-76.24c19.1 16.69 33.12 38.73 39.69 64H592c26.47 0 48-22.25 48-49.59V49.59C640 22.25 618.47 0 592 0z"></path>
      </svg>
    ),
    title: "বিশেষজ্ঞের দিকনির্দেশনা",
    description:
      "অভিজ্ঞ পণ্ডিত ও শিক্ষকদের দিকনির্দেশনায়, ছাত্ররা ধর্মীয় ও পার্থিব উভয় বিষয়ে প্রয়োজনীয় জ্ঞান ও প্রজ্ঞা অর্জন করে।",
  },
  {
    icon: (
      <svg
        stroke="currentColor"
        fill="currentColor"
        stroke-width="0"
        viewBox="0 0 576 512"
        className="text-yellow-500"
        height="30"
        width="30"
        xmlns="http://www.w3.org/2000/svg"
      >
        <path d="M546.2 9.7c-5.6-12.5-21.6-13-28.3-1.2C486.9 62.4 431.4 96 368 96h-80C182 96 96 182 96 288c0 7 .8 13.7 1.5 20.5C161.3 262.8 253.4 224 384 224c8.8 0 16 7.2 16 16s-7.2 16-16 16C132.6 256 26 410.1 2.4 468c-6.6 16.3 1.2 34.9 17.5 41.6 16.4 6.8 35-1.1 41.8-17.3 1.5-3.6 20.9-47.9 71.9-90.6 32.4 43.9 94 85.8 174.9 77.2C465.5 467.5 576 326.7 576 154.3c0-50.2-10.8-102.2-29.8-144.6z"></path>
      </svg>
    ),
    title: "চরিত্র গঠন",
    description:
      "আমাদের সার্বিক শিক্ষাদান পদ্ধতি নৈতিক ও নীতিগত উন্নয়নকে গুরুত্ব দেয়, যা ছাত্রদেরকে করুণাময় ও দায়িত্বশীল ব্যক্তি হিসেবে গড়ে তোলে।",
  },
];
